Revit 2027 API
EnergyDataSettings.GetReportsFolderParsed Method
 Gets the absolute reports folder path that is parsed from the original input.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetReportsFolderParsed()
Public Function GetReportsFolderParsed As String
public:
String^ GetReportsFolderParsed()
member GetReportsFolderParsed : unit -> string
Return Value
String
 The reports folder path after parsing the input string.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace